socialNetwork/runs/e2e-read-home-timelines-3-u6F8/output.txt
Running 30s test @ http://localhost:8080/wrk2-api/home-timeline/read
  4 threads and 64 connections

  Thread calibration: mean lat.: 15.866ms, rate sampling interval: 48ms
  Thread calibration: mean lat.: 14.240ms, rate sampling interval: 44ms
  Thread calibration: mean lat.: 14.975ms, rate sampling interval: 46ms
  Thread calibration: mean lat.: 15.206ms, rate sampling interval: 46ms
Logging function completed.

-----------------------------------------------------------------------
Test Results @ http://localhost:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    14.92ms    6.13ms  36.42ms   82.14%
    Req/Sec   252.76     75.47   431.00     67.59%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   13.00ms
 75.000%   17.53ms
 90.000%   22.83ms
 99.000%   36.42ms
 99.900%   52.35ms
 99.990%   64.64ms
 99.999%   70.21ms
100.000%   70.21ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.765     0.000000            1         1.00
       9.471     0.100000         2015         1.11
      10.311     0.200000         4013         1.25
      11.103     0.300000         6011         1.43
      11.983     0.400000         8017         1.67
      12.999     0.500000        10020         2.00
      13.599     0.550000        11019         2.22
      14.351     0.600000        12010         2.50
      15.247     0.650000        13015         2.86
      16.311     0.700000        14023         3.33
      17.535     0.750000        15019         4.00
      18.239     0.775000        15521         4.44
      18.959     0.800000        16017         5.00
      19.743     0.825000        16515         5.71
      20.559     0.850000        17012         6.67
      21.535     0.875000        17519         8.00
      22.127     0.887500        17762         8.89
      22.831     0.900000        18016        10.00
      23.599     0.912500        18264        11.43
      24.543     0.925000        18518        13.33
      25.503     0.937500        18764        16.00
      26.127     0.943750        18891        17.78
      26.863     0.950000        19019        20.00
      27.599     0.956250        19138        22.86
      28.639     0.962500        19263        26.67
      29.839     0.968750        19389        32.00
      30.543     0.971875        19452        35.56
      31.247     0.975000        19513        40.00
      31.983     0.978125        19576        45.71
      32.927     0.981250        19643        53.33
      33.823     0.984375        19702        64.00
      34.495     0.985938        19733        71.11
      35.135     0.987500        19764        80.00
      35.935     0.989062        19795        91.43
      36.767     0.990625        19829       106.67
      37.855     0.992188        19858       128.00
      38.495     0.992969        19873       142.22
      39.359     0.993750        19888       160.00
      40.319     0.994531        19905       182.86
      41.919     0.995313        19920       213.33
      43.071     0.996094        19935       256.00
      43.487     0.996484        19943       284.44
      44.735     0.996875        19951       320.00
      45.439     0.997266        19959       365.71
      46.751     0.997656        19967       426.67
      47.871     0.998047        19974       512.00
      48.511     0.998242        19978       568.89
      49.631     0.998437        19982       640.00
      50.271     0.998633        19986       731.43
      51.679     0.998828        19990       853.33
      52.639     0.999023        19994      1024.00
      53.343     0.999121        19997      1137.78
      53.503     0.999219        19998      1280.00
      54.431     0.999316        20000      1462.86
      55.391     0.999414        20002      1706.67
      57.855     0.999512        20004      2048.00
      58.335     0.999561        20005      2275.56
      60.735     0.999609        20006      2560.00
      61.535     0.999658        20007      2925.71
      61.631     0.999707        20008      3413.33
      63.039     0.999756        20009      4096.00
      63.039     0.999780        20009      4551.11
      63.903     0.999805        20010      5120.00
      63.903     0.999829        20010      5851.43
      64.639     0.999854        20011      6826.67
      64.639     0.999878        20011      8192.00
      64.639     0.999890        20011      9102.22
      64.959     0.999902        20012     10240.00
      64.959     0.999915        20012     11702.86
      64.959     0.999927        20012     13653.33
      64.959     0.999939        20012     16384.00
      64.959     0.999945        20012     18204.44
      70.207     0.999951        20013     20480.00
      70.207     1.000000        20013          inf
#[Mean    =       14.922, StdDeviation   =        6.131]
#[Max     =       70.144, Total count    =        20013]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  29437 requests in 30.00s, 411.81MB read
Requests/sec:    981.20  
Transfer/sec:     13.73MB